### Pandas tutorial

Pandas is an open source library providing high performance, easy to use data structure and data analysis tools for the python programming language

In [1]:
import pandas as pd
import numpy as np

In [15]:
#playing with dataframe
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index = ['Row1','Row2','Row3','Row4','Row5'], columns = ['Columns1','Columns2','Columns3','Columns4'])

In [16]:
df.head()

      Columns1  Columns2  Columns3  Columns4
Row1         0         1         2         3
Row2         4         5         6         7
Row3         8         9        10        11
Row4        12        13        14        15
Row5        16        17        18        19

saving above dataframe in csv file format on you local computer

In [17]:
df.to_csv("Test1.csv")#after executing it you can check your folder to see csv file

### Acessing the elements

In [18]:
df.loc['Row1']

Columns1    0
Columns2    1
Columns3    2
Columns4    3
Name: Row1, dtype: int64

In [22]:
type(df.loc['Row1'])

pandas.core.series.Series

In [20]:
df.iloc[0:2,0:2]

      Columns1  Columns2
Row1         0         1
Row2         4         5

In [21]:
type(df.iloc[0:2,0:2])

pandas.core.frame.DataFrame

In [23]:
df.iloc[1:2,1:2]

      Columns2
Row2         5

In [24]:
type(df.iloc[1:2,1:2])

pandas.core.frame.DataFrame

In [25]:
df.iloc[0,0:3]

Columns1    0
Columns2    1
Columns3    2
Name: Row1, dtype: int64

In [26]:
type(df.iloc[0,0:3])

pandas.core.series.Series

In [27]:
df.iloc[:,1:]

      Columns2  Columns3  Columns4
Row1         1         2         3
Row2         5         6         7
Row3         9        10        11
Row4        13        14        15
Row5        17        18        19

In [28]:
#converting dataframes into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [29]:
df.iloc[:,1:].shape

(5, 3)

In [33]:
df.isnull().sum() #to check the values either null or not

Columns1    0
Columns2    0
Columns3    0
Columns4    0
dtype: int64

In [38]:
df['Columns1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Columns1, dtype: int64

In [44]:
df['Columns2'].unique()

array([ 1,  5,  9, 13, 17])

In [45]:
df[['Columns1','Columns2']]

      Columns1  Columns2
Row1         0         1
Row2         4         5
Row3         8         9
Row4        12        13
Row5        16        17

### HOW TO READ A FILE(CSV,EXCEL,JSON,ETC) USING PANDAS

In [46]:
df = pd.read_csv('test.csv')

In [47]:
df

,ID,X0,X1,X2,X3,X4,X5,X6,X8,X10,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,1,az,v,n,f,d,t,a,w,0,...,0,0,0,1,0,0,0,0,0,0
1,2,t,b,ai,a,d,b,g,y,0,...,0,0,1,0,0,0,0,0,0,0
2,3,az,v,as,f,d,a,j,j,0,...,0,0,0,1,0,0,0,0,0,0
3,4,az,l,n,f,d,z,l,n,0,...,0,0,0,1,0,0,0,0,0,0
4,5,w,s,as,c,d,y,i,m,0,...,1,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4204,8410,aj,h,as,f,d,aa,j,e,0,...,0,0,0,0,0,0,0,0,0,0
4205,8411,t,aa,ai,d,d,aa,j,y,0,...,0,1,0,0,0,0,0,0,0,0
4206,8413,y,v,as,f,d,aa,d,w,0,...,0,0,0,0,0,0,0,0,0,0
4207,8414,ak,v,as,a,d,aa,c,q,0,...,0,0,1,0,0,0,0,0,0,0
4208,8416,t,aa,ai,c,d,aa,g,r,0,...,1,0,0,0,0,0,0,0,0,0

In [48]:
df.head()

,ID,X0,X1,X2,X3,X4,X5,X6,X8,X10,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,1,az,v,n,f,d,t,a,w,0,...,0,0,0,1,0,0,0,0,0,0
1,2,t,b,ai,a,d,b,g,y,0,...,0,0,1,0,0,0,0,0,0,0
2,3,az,v,as,f,d,a,j,j,0,...,0,0,0,1,0,0,0,0,0,0
3,4,az,l,n,f,d,z,l,n,0,...,0,0,0,1,0,0,0,0,0,0
4,5,w,s,as,c,d,y,i,m,0,...,1,0,0,0,0,0,0,0,0,0

In [49]:
df.info()#it describes the data just like no of columns,dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 377 entries, ID to X385
dtypes: int64(369), object(8)
memory usage: 12.1+ MB

In [50]:
df.describe()

,ID,X10,X11,X12,X13,X14,X15,X16,X17,X18,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4211.039202,0.019007,0.000238,0.074364,0.061060,0.427893,0.000713,0.002613,0.008791,0.010216,...,0.325968,0.049656,0.311951,0.019244,0.011879,0.008078,0.008791,0.000475,0.000713,0.001663
std,2423.078926,0.136565,0.015414,0.262394,0.239468,0.494832,0.026691,0.051061,0.093357,0.100570,...,0.468791,0.217258,0.463345,0.137399,0.108356,0.089524,0.093357,0.021796,0.026691,0.040752
min,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2115.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4202.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6310.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8416.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

if in the file rows,columns and their values are sperated by semicolon instead of commas we can also read this file

In [55]:
df1 = pd.read_csv('test1.csv',sep = ';')

In [56]:
df1

  Unnamed: 0  Columns1  Columns2  Columns3  Columns4
0       Row1         0         1         2         3
1       Row2         4         5         6         7
2       Row3         8         9        10        11
3       Row4        12        13        14        15
4       Row5        16        17        18        19

In [57]:
df['X0']

0       az
1        t
2       az
3       az
4        w
        ..
4204    aj
4205     t
4206     y
4207    ak
4208     t
Name: X0, Length: 4209, dtype: object

In [58]:
#get the unique category counts
df['X0'].value_counts()

ak    432
y     348
z     335
x     302
ay    299
t     293
o     246
f     213
w     198
j     171
n     167
aj    162
az    161
s     116
ap    108
al     88
h      64
d      61
e      48
v      40
ai     38
m      34
af     34
am     28
i      25
at     21
u      20
ba     19
a      18
b      13
k      12
ad     12
aq     11
aw     11
r      10
ax      8
l       6
bc      6
c       6
as      6
ao      5
au      5
g       3
p       1
ae      1
av      1
an      1
ag      1
bb      1
Name: X0, dtype: int64

### CSV

In [7]:
from io import StringIO, BytesIO

In [65]:
data = ('col1,col2,col3\n'
       'x,y,1\n'
       'c,d,2\n')

In [63]:
type(data)

str

In [64]:
#now converting str into dataframe
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    c    d     2

### Read from specific columns

In [67]:
df2 = pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [69]:
df2

  col1  col3
0    x     1
1    c     2

### writing to csv file

In [71]:
df2.to_csv('data.csv')

### specifying columns data types

In [117]:
data = ('col1,col2,col3,col4\n'
        '1,2,3,4\n'
       '9,10,23,24\n'
       '11,24,46,33')

In [96]:
print(data)

col1,col2,col3,col4
1,2,3,4
9,10,23,24
11,24,46,33

In [97]:
df3 = pd.read_csv(StringIO(data),dtype=object)

In [98]:
df3

  col1 col2 col3 col4
0    1    2    3    4
1    9   10   23   24
2   11   24   46   33

In [99]:
df3['col1']

0     1
1     9
2    11
Name: col1, dtype: object

if want to make dtype to other like int,float you can easily make by changing dtype

In [109]:
df3 = pd.read_csv(StringIO(data),dtype=float)

In [110]:
df3

   col1  col2  col3  col4
0   1.0   2.0   3.0   4.0
1   9.0  10.0  23.0  24.0
2  11.0  24.0  46.0  33.0

In [111]:
df['col3']

w        z
1        4
9       24
1.1    3.3
Name: col3, dtype: object

In [118]:
df3 = pd.read_csv(StringIO(data),dtype={'col1':int,'col2':float,'col3':'Int64','col4':str})

In [119]:
df3

   col1  col2  col3 col4
0     1   2.0     3    4
1     9  10.0    23   24
2    11  24.0    46   33

In [121]:
type(df3['col1'][2])

numpy.int64

### check the all datatypes

In [123]:
df3.dtypes

col1      int64
col2    float64
col3      Int64
col4     object
dtype: object

### Index columns and training delimeters

In [125]:
data = ('index,a,b,c\n'
       '4,apple,bats,5.7\n'
       '8,orange,cow,10')

In [126]:
pd.read_csv(StringIO(data))

   index       a     b     c
0      4   apple  bats   5.7
1      8  orange   cow  10.0

In [129]:
#to make our given index as an index just use index_col
pd.read_csv(StringIO(data),index_col=0)

            a     b     c
index
4       apple  bats   5.7
8      orange   cow  10.0

In [9]:
data = ('a,b,c,d\n'
       '4,apple,bats,5.7,\n'
       '8,orange,cow,10,')

In [137]:
df=pd.read_csv(StringIO(data))

In [138]:
df

        a     b     c   d
4   apple  bats   5.7 NaN
8  orange   cow  10.0 NaN

Here in above data frame 4,8 by default make index_row and column 'd' is filled with None value to handle such situation use the index_col = False

In [141]:
pd.read_csv(StringIO(data),index_col=False)

   a       b     c     d
0  4   apple  bats   5.7
1  8  orange   cow  10.0

### Combining usecols and index_col

In [10]:
pd.read_csv(StringIO(data),usecols=['b','a','c'],index_col=False)

   a       b     c
0  4   apple  bats
1  8  orange   cow

In [144]:
### Quoting and Escape characters very useful in NLP
data = 'a,b\n"hello,\\"Bob\\",nice to see you",5'

In [145]:
pd.read_csv(StringIO(data),escapechar='\\')

                             a  b
0  hello,"Bob",nice to see you  5

### URL to CSV

In [146]:
url = "https://raw.githubusercontent.com/SkyTowner/sample_data/main/pandas/simple_dataset.csv"

In [147]:
df=pd.read_csv(url)

In [148]:
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

### Reading JSON to CSV

In [18]:
json_string = '[{"Name": "Nik", "Age": 30, "Active": true}, {"Name": "Kate", "Age": 32, "Active": true}, {"Name": "Evan", "Age": 45, "Active": false}, {"Name": "Kyra", "Age": 43, "Active": true}]'

In [19]:
df = pd.read_json(json_string)

In [20]:
df

   Name  Age  Active
0   Nik   30    True
1  Kate   32    True
2  Evan   45   False
3  Kyra   43    True

In [21]:
df.to_csv('file.csv')